#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/pocitace/tfc-demo/runs/run-qrUUzLGsCGB18hyq

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
hcloud_server.workers["deimos"]: Refreshing state... [id=17175565]
hcloud_server.workers["hydra"]: Refreshing state... [id=17175566]
hcloud_server.fantaghiro: Refreshing state... [id=17175568]
hcloud_server.workers["charon"]: Refreshing state... [id=17175567]
hcloud_server.workers["phobos"]: Refreshing state... [id=17175564]
cloudflare_record.fantaghiro: Refreshing state... [id=3e8db526d471fd65cbe02d81de13d89a]
cloudflare_record.workers["deimos"]: Refreshing state... [id=d53867c036ec06863111abed18efc7bb]
cloudflare_record.workers["charon"]: Refreshing state... [id=eb930df78db95c8b84deea3336511dc4]
cloudflare_record.workers["phobos"]: Refreshing state... [id=58958db45b14ad7c5b393bfb1967e35b]
cloudflare_record.workers["hydra"]: Refreshing state... [id=7a6ace22ffc41f910d862b22c32c0473]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # hcloud_server.fantaghiro has changed
  ~ resource "hcloud_server" "fantaghiro" {
        id                 = "17175568"
      + labels             = {}
        name               = "fantaghiro"
        # (15 unchanged attributes hidden)
    }

  # hcloud_server.workers["charon"] has changed
  ~ resource "hcloud_server" "workers" {
        id                 = "17175567"
      + labels             = {}
        name               = "charon"
        # (15 unchanged attributes hidden)
    }

  # hcloud_server.workers["deimos"] has changed
  ~ resource "hcloud_server" "workers" {
        id                 = "17175565"
      + labels             = {}
        name               = "deimos"
        # (15 unchanged attributes hidden)
    }

  # hcloud_server.workers["hydra"] has changed
  ~ resource "hcloud_server" "workers" {
        id                 = "17175566"
      + labels             = {}
        name               = "hydra"
        # (15 unchanged attributes hidden)
    }

  # hcloud_server.workers["phobos"] has changed
  ~ resource "hcloud_server" "workers" {
        id                 = "17175564"
      + labels             = {}
        name               = "phobos"
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.workers["callisto"] will be created
  + resource "cloudflare_record" "workers" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "callisto"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = (sensitive)
    }

  # hcloud_server.workers["callisto"] will be created
  + resource "hcloud_server" "workers" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = (known after apply)
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + location           = "nbg1"
      + name               = "callisto"
      + rebuild_protection = false
      + server_type        = "cx31"
      + ssh_keys           = [
          + "mb",
        ]
      + status             = (known after apply)
      + user_data          = "oeJeaTg5fOnNZ+G1CcpFgaaMbOI="
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @mtmn, Action: `pull_request`*